docs/EV1 Entrega/Anexos/jmeter/html_report/statistics.json
{
  "GET Examenes" : {
    "transaction" : "GET Examenes",
    "sampleCount" : 40,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5006.2,
    "medianResTime" : 5006.0,
    "minResTime" : 5004.0,
    "maxResTime" : 5016.0,
    "pct1ResTime" : 5007.9,
    "pct2ResTime" : 5008.0,
    "pct3ResTime" : 5016.0,
    "throughput" : 1.379595778436918,
    "receivedKBytesPerSec" : 0.8541637925087949,
    "sentKBytesPerSec" : 0.6695889666827619
  },
  "POST Login" : {
    "transaction" : "POST Login",
    "sampleCount" : 40,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 10.975,
    "medianResTime" : 8.0,
    "minResTime" : 6.0,
    "maxResTime" : 93.0,
    "pct1ResTime" : 13.0,
    "pct2ResTime" : 14.0,
    "pct3ResTime" : 93.0,
    "throughput" : 1.6577562269468276,
    "receivedKBytesPerSec" : 0.9454390981806124,
    "sentKBytesPerSec" : 0.6936997492643706
  },
  "GET Pacientes" : {
    "transaction" : "GET Pacientes",
    "sampleCount" : 40,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5007.424999999999,
    "medianResTime" : 5007.0,
    "minResTime" : 5005.0,
    "maxResTime" : 5010.0,
    "pct1ResTime" : 5009.0,
    "pct2ResTime" : 5010.0,
    "pct3ResTime" : 5010.0,
    "throughput" : 1.3795006207752794,
    "receivedKBytesPerSec" : 20.346286987860395,
    "sentKBytesPerSec" : 0.6708899503379777
  },
  "GET Examenes B" : {
    "transaction" : "GET Examenes B",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5008.339999999998,
    "medianResTime" : 5008.0,
    "minResTime" : 5006.0,
    "maxResTime" : 5013.0,
    "pct1ResTime" : 5010.0,
    "pct2ResTime" : 5011.0,
    "pct3ResTime" : 5013.0,
    "throughput" : 2.0328508700601726,
    "receivedKBytesPerSec" : 1.203034792242641,
    "sentKBytesPerSec" : 0.9767213164742234
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 220,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2963.186363636363,
    "medianResTime" : 5006.0,
    "minResTime" : 6.0,
    "maxResTime" : 5016.0,
    "pct1ResTime" : 5009.0,
    "pct2ResTime" : 5010.0,
    "pct3ResTime" : 5012.58,
    "throughput" : 3.7434064999149226,
    "receivedKBytesPerSec" : 11.813465096988258,
    "sentKBytesPerSec" : 1.5842346222562531
  },
  "POST Login B" : {
    "transaction" : "POST Login B",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 10.0,
    "medianResTime" : 10.0,
    "minResTime" : 7.0,
    "maxResTime" : 14.0,
    "pct1ResTime" : 12.0,
    "pct2ResTime" : 13.0,
    "pct3ResTime" : 14.0,
    "throughput" : 2.5511505689065768,
    "receivedKBytesPerSec" : 1.385195035460993,
    "sentKBytesPerSec" : 0.6876148017756007
  }
}